library random_food.globals;

// 글로벌 변수
List kor = [
  '떡볶이',
  '삼겹살',
  '김밥',
  '곱창',
  '불고기',
  '냉면',
  '칼국수',
  '된장찌개',
  '비빔밥',
  '김치찌개',
  '만두',
  '국밥',
];
List eu = [
  '피자',
  '샐러드',
  '파스타',
  '스테이크',
  '샌드위치',
  '버거',
  '토스트',
  '바베큐',
  '핫도그',
  '리조또',
  '부리또',
  '타코',
];

List chn = [
  '볶음밥',
  '짬뽕',
  '짜장면',
  '탕수육',
  '딤섬',
  '깐풍기',
  '마라탕',
  '칠리새우',
  '양꼬치',
];
List jpn = [
  '라멘',
  '돈까스',
  '초밥',
  '샤브샤브',
  '덮밥',
  '우동',
  '소바',
  '오코노미야키',
  '타코야키',
  '회',
  '오뎅',
  '가라아게',
];
List asia = [
  '쌀국수',
  '팟타이',
  '카레',
  '나시고랭',
];
List noodle = [
  '쌀국수',
  '팟타이',
  '우동',
  '소바',
  '라멘',
  '짬뽕',
  '짜장면',
  '파스타',
  '냉면',
  '칼국수',
];
List rice = [
  '김밥',
  '된장찌개',
  '비빔밥',
  '김치찌개',
  '국밥',
  '리조또',
  '부리또',
  '볶음밥',
  '덮밥',
  '초밥',
];
List meat = [
  '삼겹살',
  '곱창',
  '불고기',
  '스테이크',
  '바베큐',
  '타코',
];

List randomFoodList = asia + kor + jpn + eu + chn;
List total = [];

Map<String, List> mapItem = {
  '전체': total,
  "중국": chn,
  "한국": kor,
  "일본": jpn,
  "동남아": asia,
  "유럽": eu,
};

List listImage = asia + kor + jpn + eu + chn;
